src/test/load/artillery/system/update-config/retrieval/group-1.yml
config:
  target: http://192.168.0.150:6898
  phases:
    - duration: 15
      arrivalRate: 5
  payload:
    # path is relative to the location of the test script
    - path: "../../../hosts.csv"
      order: sequence
      fields:
        - "host"

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://{{ host }}/nomad/config/retrieval?retrievalMode=FAST"
      # - post:
      #     url: "http://{{ host }}/nomad/config/retrieval?retrievalMode=PARALLEL"
      # - post:
      #     url: "http://{{ host }}/nomad/config/retrieval?retrievalMode=SAFE"