src/test/load/artillery/system/update-config/retrieval/group-6.yml
config:
  target: http://192.168.0.150:6898
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://192.168.0.150:4004/nomad/config/retrieval?retrievalMode=PARALLEL"
      - post:
          url: "http://192.168.0.150:4029/nomad/config/retrieval?retrievalMode=PARALLEL"
      - post:
          url: "http://192.168.0.150:4009/nomad/config/retrieval?retrievalMode=PARALLEL"
      - post:
          url: "http://192.168.0.150:4049/nomad/config/retrieval?retrievalMode=PARALLEL"