src/test/load/artillery/system/update-config/retrieval/group-7.yml
config:
  target: http://192.168.0.150:6898
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: peer-1
    weight: 1
    flow:
      - post:
          url: "http://192.168.0.150:4017/nomad/config/retrieval?retrievalMode=PARALLEL"
      - post:
          url: "http://192.168.0.150:4045/nomad/config/retrieval?retrievalMode=PARALLEL"
      - post:
          url: "http://192.168.0.150:4032/nomad/config/retrieval?retrievalMode=PARALLEL"
      - post:
          url: "http://192.168.0.150:4047/nomad/config/retrieval?retrievalMode=PARALLEL"